Ran Plan for 2 projects:

1. dir: `terraform/atlantis` workspace: `default`
1. dir: `terraform` workspace: `default`

### 1. dir: `terraform/atlantis` workspace: `default`
<details><summary>Show Output</summary>

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # kubernetes_secret.tls has been changed
~ resource "kubernetes_secret" "tls" {
        id        = "pritunl/wayofthesys-com-pritunl-tls"
        # (3 unchanged attributes hidden)

      ~ metadata {
          + annotations      = {}
          + labels           = {}
            name             = "wayofthesys-com-pritunl-tls"
            # (4 unchanged attributes hidden)
        }
    }
  # kubernetes_namespace.pritunl has been changed
~ resource "kubernetes_namespace" "pritunl" {
        id = "pritunl"

      ~ metadata {
          + annotations      = {}
          + labels           = {}
            name             = "pritunl"
            # (3 unchanged attributes hidden)
        }
    }
  # kubernetes_secret.docker_login_secret has been changed
~ resource "kubernetes_secret" "docker_login_secret" {
        id        = "pritunl/wayofthesys-com-docker-login"
        # (3 unchanged attributes hidden)

      ~ metadata {
          + annotations      = {}
          + labels           = {}
            name             = "wayofthesys-com-docker-login"
            # (4 unchanged attributes hidden)
        }
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # helm_release.mongodb will be created
+ resource "helm_release" "mongodb" {
      + atomic                     = false
      + chart                      = "mongodb"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "pritunl-mongodb"
      + namespace                  = "pritunl"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://charts.bitnami.com/bitnami"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + (sensitive),
        ]
      + verify                     = false
      + version                    = "11.1.2"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.pritunl will be created
+ resource "helm_release" "pritunl" {
      + atomic                     = false
      + chart                      = "pritunl"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "pritunl"
      + namespace                  = "pritunl"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "./helm_charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                image:
                  registry: ghcr.io  
                  repository: autotune/pritunl-k8s-tf-do/autotune/pritunl-k8s-tf-do
                  tag: pritunl:b8b03170 
                  pullPolicy: Always
                  pullSecret: "wayofthesys-com-docker-login"
                  domain_name: "wayofthesys-com"
                
                # This should match whatever the 'mongodb' service is called in the cluster.
                # DNS should be able to resolve the service by this name for Pritunl to function.
                mongoService: "pritunl-mongodb"
                
                # Change these as you see fit.
                ports:
                  http: 80
                  vpn: 1194
                  webui: 443
                
                # This must be enabled when using Pritunl due to the rights that iptables will need in the Pritunl pods.
                privileged:
                  enabled: true
                
                # This will adjust the replicas that are deployed as a part of the Pritunl deployment.
                # This is '3' by default. Your Pritunl cluster number will be affected by this.
                replicaCount: 3
                
                # If 'type' here is 'LoadBalancer', these annotations are necessary to properly use an ELB if deploying this chart in AWS, so they'll automatically get used.
                # Be sure to add the appropriate domain name, cert ARN, and ssl-negotiation-policy (a default is used here).
                service:
                  annotations:
                  type: ClusterIP
                
                tty:
                  enabled: true
                
                # Health Checks
                livenessProbe:
                  enabled: true
                  initialDelaySeconds: 30
                  periodSeconds: 10
                  timeoutSeconds: 5
                  failureThreshold: 6
                  successThreshold: 1
                
                readinessProbe:
                  enabled: true
                  initialDelaySeconds: 5
                  periodSeconds: 10
                  timeoutSeconds: 5
                  failureThreshold: 6
                  successThreshold: 1
            EOT,
        ]
      + verify                     = false
      + version                    = "0.0.5"
      + wait                       = true
      + wait_for_jobs              = false
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Warning: Version constraints inside provider configuration blocks are deprecated

  on providers.tf line 12, in provider "digitalocean":
  12:   version = ">=1.5.0"

Terraform 0.13 and earlier allowed provider version constraints inside the
provider configuration block, but that is now deprecated and will be removed
in a future version of Terraform. To silence this warning, move the provider
version constraint into the required_providers block.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform/atlantis`
* :put_litter_in_its_place: To **delete** this plan click [here](https://wayofthesys.com/lock?id=autotune%252Fpritunl-k8s-tf-do%252Fterraform%252Fatlantis%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform/atlantis`
</details>
Plan: 2 to add, 0 to change, 0 to destroy.

---
### 2. dir: `terraform` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/usr/local/bin/terraform plan -input=false -refresh -no-color -out \"/root/.atlantis/repos/autotune/pritunl-k8s-tf-do/7/default/terraform/default.tfplan\"" in "/root/.atlantis/repos/autotune/pritunl-k8s-tf-do/7/default/terraform": exit status 1

Warning: Version constraints inside provider configuration blocks are deprecated

  on provider.tf line 12, in provider "digitalocean":
  12:   version = ">=1.5.0"

Terraform 0.13 and earlier allowed provider version constraints inside the
provider configuration block, but that is now deprecated and will be removed
in a future version of Terraform. To silence this warning, move the provider
version constraint into the required_providers block.

Error: No value for required variable

  on variables.tf line 72:
  72: variable "atlantis_github_user" {

The root module input variable "atlantis_github_user" is not set, and has no
default value. Use a -var or -var-file command line argument to provide a
value for this variable.

Error: No value for required variable

  on variables.tf line 76:
  76: variable "atlantis_github_user_token" {

The root module input variable "atlantis_github_user_token" is not set, and
has no default value. Use a -var or -var-file command line argument to
provide a value for this variable.

Error: No value for required variable

  on variables.tf line 80:
  80: variable "letsencrypt_email" {

The root module input variable "letsencrypt_email" is not set, and has no
default value. Use a -var or -var-file command line argument to provide a
value for this variable.

Error: No value for required variable

  on variables.tf line 101:
 101: variable "github_token" {

The root module input variable "github_token" is not set, and has no default
value. Use a -var or -var-file command line argument to provide a value for
this variable.

Error: No value for required variable

  on variables.tf line 105:
 105: variable "sslcom_keyid" {

The root module input variable "sslcom_keyid" is not set, and has no default
value. Use a -var or -var-file command line argument to provide a value for
this variable.

Error: No value for required variable

  on variables.tf line 109:
 109: variable "sslcom_hmac_key" {

The root module input variable "sslcom_hmac_key" is not set, and has no
default value. Use a -var or -var-file command line argument to provide a
value for this variable.

Error: No value for required variable

  on variables.tf line 113:
 113: variable "sslcom_private_hmac_key" {

The root module input variable "sslcom_private_hmac_key" is not set, and has
no default value. Use a -var or -var-file command line argument to provide a
value for this variable.

Error: No value for required variable

  on variables.tf line 125:
 125: variable "oauth_cookie_secret" {

The root module input variable "oauth_cookie_secret" is not set, and has no
default value. Use a -var or -var-file command line argument to provide a
value for this variable.

Error: No value for required variable

  on variables.tf line 129:
 129: variable "aws_access_key_id" {

The root module input variable "aws_access_key_id" is not set, and has no
default value. Use a -var or -var-file command line argument to provide a
value for this variable.

Error: No value for required variable

  on variables.tf line 133:
 133: variable "aws_secret_access_key" {

The root module input variable "aws_secret_access_key" is not set, and has no
default value. Use a -var or -var-file command line argument to provide a
value for this variable.

```
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
